digidocservice/trunk/tests/NewFile.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Body>
		<ns1:CreateSignedDoc soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns1="http://www.sk.ee/DigiDocService/DigiDocService_2_3.wsdl">
			<Sesscode href="#id0" />
			<Format xsi:type="xsd:string">DIGIDOC-XML</Format>
			<Version xsi:type="xsd:string">1.4</Version>
		</ns1:CreateSignedDoc>
		<multiRef id="id0" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="xsd:int" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">7667</multiRef>
	</soapenv:Body>
</soapenv:Envelope>
